; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l5-t1-p16---int100n150-m25---int100c150---s517---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level3 level3)
(sum level0 level8 level8)
(sum level0 level10 level10)
(sum level0 level14 level14)
(sum level0 level20 level20)
(sum level0 level23 level23)
(sum level1 level1 level2)
(sum level1 level3 level4)
(sum level1 level8 level9)
(sum level1 level10 level11)
(sum level1 level14 level15)
(sum level1 level20 level21)
(sum level1 level23 level24)
(sum level2 level1 level3)
(sum level2 level3 level5)
(sum level2 level8 level10)
(sum level2 level10 level12)
(sum level2 level14 level16)
(sum level2 level20 level22)
(sum level2 level23 level25)
(sum level3 level1 level4)
(sum level3 level3 level6)
(sum level3 level8 level11)
(sum level3 level10 level13)
(sum level3 level14 level17)
(sum level3 level20 level23)
(sum level3 level23 level26)
(sum level4 level1 level5)
(sum level4 level3 level7)
(sum level4 level8 level12)
(sum level4 level10 level14)
(sum level4 level14 level18)
(sum level4 level20 level24)
(sum level4 level23 level27)
(sum level5 level1 level6)
(sum level5 level3 level8)
(sum level5 level8 level13)
(sum level5 level10 level15)
(sum level5 level14 level19)
(sum level5 level20 level25)
(sum level5 level23 level28)
(sum level6 level1 level7)
(sum level6 level3 level9)
(sum level6 level8 level14)
(sum level6 level10 level16)
(sum level6 level14 level20)
(sum level6 level20 level26)
(sum level6 level23 level29)
(sum level7 level1 level8)
(sum level7 level3 level10)
(sum level7 level8 level15)
(sum level7 level10 level17)
(sum level7 level14 level21)
(sum level7 level20 level27)
(sum level7 level23 level30)
(sum level8 level1 level9)
(sum level8 level3 level11)
(sum level8 level8 level16)
(sum level8 level10 level18)
(sum level8 level14 level22)
(sum level8 level20 level28)
(sum level8 level23 level31)
(sum level9 level1 level10)
(sum level9 level3 level12)
(sum level9 level8 level17)
(sum level9 level10 level19)
(sum level9 level14 level23)
(sum level9 level20 level29)
(sum level9 level23 level32)
(sum level10 level1 level11)
(sum level10 level3 level13)
(sum level10 level8 level18)
(sum level10 level10 level20)
(sum level10 level14 level24)
(sum level10 level20 level30)
(sum level10 level23 level33)
(sum level11 level1 level12)
(sum level11 level3 level14)
(sum level11 level8 level19)
(sum level11 level10 level21)
(sum level11 level14 level25)
(sum level11 level20 level31)
(sum level11 level23 level34)
(sum level12 level1 level13)
(sum level12 level3 level15)
(sum level12 level8 level20)
(sum level12 level10 level22)
(sum level12 level14 level26)
(sum level12 level20 level32)
(sum level12 level23 level35)
(sum level13 level1 level14)
(sum level13 level3 level16)
(sum level13 level8 level21)
(sum level13 level10 level23)
(sum level13 level14 level27)
(sum level13 level20 level33)
(sum level13 level23 level36)
(sum level14 level1 level15)
(sum level14 level3 level17)
(sum level14 level8 level22)
(sum level14 level10 level24)
(sum level14 level14 level28)
(sum level14 level20 level34)
(sum level14 level23 level37)
(sum level15 level1 level16)
(sum level15 level3 level18)
(sum level15 level8 level23)
(sum level15 level10 level25)
(sum level15 level14 level29)
(sum level15 level20 level35)
(sum level15 level23 level38)
(sum level16 level1 level17)
(sum level16 level3 level19)
(sum level16 level8 level24)
(sum level16 level10 level26)
(sum level16 level14 level30)
(sum level16 level20 level36)
(sum level16 level23 level39)
(sum level17 level1 level18)
(sum level17 level3 level20)
(sum level17 level8 level25)
(sum level17 level10 level27)
(sum level17 level14 level31)
(sum level17 level20 level37)
(sum level17 level23 level40)
(sum level18 level1 level19)
(sum level18 level3 level21)
(sum level18 level8 level26)
(sum level18 level10 level28)
(sum level18 level14 level32)
(sum level18 level20 level38)
(sum level18 level23 level41)
(sum level19 level1 level20)
(sum level19 level3 level22)
(sum level19 level8 level27)
(sum level19 level10 level29)
(sum level19 level14 level33)
(sum level19 level20 level39)
(sum level19 level23 level42)
(sum level20 level1 level21)
(sum level20 level3 level23)
(sum level20 level8 level28)
(sum level20 level10 level30)
(sum level20 level14 level34)
(sum level20 level20 level40)
(sum level20 level23 level43)
(sum level21 level1 level22)
(sum level21 level3 level24)
(sum level21 level8 level29)
(sum level21 level10 level31)
(sum level21 level14 level35)
(sum level21 level20 level41)
(sum level21 level23 level44)
(sum level22 level1 level23)
(sum level22 level3 level25)
(sum level22 level8 level30)
(sum level22 level10 level32)
(sum level22 level14 level36)
(sum level22 level20 level42)
(sum level22 level23 level45)
(sum level23 level1 level24)
(sum level23 level3 level26)
(sum level23 level8 level31)
(sum level23 level10 level33)
(sum level23 level14 level37)
(sum level23 level20 level43)
(sum level23 level23 level46)
(sum level24 level1 level25)
(sum level24 level3 level27)
(sum level24 level8 level32)
(sum level24 level10 level34)
(sum level24 level14 level38)
(sum level24 level20 level44)
(sum level24 level23 level47)
(sum level25 level1 level26)
(sum level25 level3 level28)
(sum level25 level8 level33)
(sum level25 level10 level35)
(sum level25 level14 level39)
(sum level25 level20 level45)
(sum level25 level23 level48)
(sum level26 level1 level27)
(sum level26 level3 level29)
(sum level26 level8 level34)
(sum level26 level10 level36)
(sum level26 level14 level40)
(sum level26 level20 level46)
(sum level26 level23 level49)
(sum level27 level1 level28)
(sum level27 level3 level30)
(sum level27 level8 level35)
(sum level27 level10 level37)
(sum level27 level14 level41)
(sum level27 level20 level47)
(sum level27 level23 level50)
(sum level28 level1 level29)
(sum level28 level3 level31)
(sum level28 level8 level36)
(sum level28 level10 level38)
(sum level28 level14 level42)
(sum level28 level20 level48)
(sum level28 level23 level51)
(sum level29 level1 level30)
(sum level29 level3 level32)
(sum level29 level8 level37)
(sum level29 level10 level39)
(sum level29 level14 level43)
(sum level29 level20 level49)
(sum level29 level23 level52)
(sum level30 level1 level31)
(sum level30 level3 level33)
(sum level30 level8 level38)
(sum level30 level10 level40)
(sum level30 level14 level44)
(sum level30 level20 level50)
(sum level30 level23 level53)
(sum level31 level1 level32)
(sum level31 level3 level34)
(sum level31 level8 level39)
(sum level31 level10 level41)
(sum level31 level14 level45)
(sum level31 level20 level51)
(sum level31 level23 level54)
(sum level32 level1 level33)
(sum level32 level3 level35)
(sum level32 level8 level40)
(sum level32 level10 level42)
(sum level32 level14 level46)
(sum level32 level20 level52)
(sum level32 level23 level55)
(sum level33 level1 level34)
(sum level33 level3 level36)
(sum level33 level8 level41)
(sum level33 level10 level43)
(sum level33 level14 level47)
(sum level33 level20 level53)
(sum level33 level23 level56)
(sum level34 level1 level35)
(sum level34 level3 level37)
(sum level34 level8 level42)
(sum level34 level10 level44)
(sum level34 level14 level48)
(sum level34 level20 level54)
(sum level34 level23 level57)
(sum level35 level1 level36)
(sum level35 level3 level38)
(sum level35 level8 level43)
(sum level35 level10 level45)
(sum level35 level14 level49)
(sum level35 level20 level55)
(sum level35 level23 level58)
(sum level36 level1 level37)
(sum level36 level3 level39)
(sum level36 level8 level44)
(sum level36 level10 level46)
(sum level36 level14 level50)
(sum level36 level20 level56)
(sum level36 level23 level59)
(sum level37 level1 level38)
(sum level37 level3 level40)
(sum level37 level8 level45)
(sum level37 level10 level47)
(sum level37 level14 level51)
(sum level37 level20 level57)
(sum level37 level23 level60)
(sum level38 level1 level39)
(sum level38 level3 level41)
(sum level38 level8 level46)
(sum level38 level10 level48)
(sum level38 level14 level52)
(sum level38 level20 level58)
(sum level38 level23 level61)
(sum level39 level1 level40)
(sum level39 level3 level42)
(sum level39 level8 level47)
(sum level39 level10 level49)
(sum level39 level14 level53)
(sum level39 level20 level59)
(sum level39 level23 level62)
(sum level40 level1 level41)
(sum level40 level3 level43)
(sum level40 level8 level48)
(sum level40 level10 level50)
(sum level40 level14 level54)
(sum level40 level20 level60)
(sum level40 level23 level63)
(sum level41 level1 level42)
(sum level41 level3 level44)
(sum level41 level8 level49)
(sum level41 level10 level51)
(sum level41 level14 level55)
(sum level41 level20 level61)
(sum level41 level23 level64)
(sum level42 level1 level43)
(sum level42 level3 level45)
(sum level42 level8 level50)
(sum level42 level10 level52)
(sum level42 level14 level56)
(sum level42 level20 level62)
(sum level42 level23 level65)
(sum level43 level1 level44)
(sum level43 level3 level46)
(sum level43 level8 level51)
(sum level43 level10 level53)
(sum level43 level14 level57)
(sum level43 level20 level63)
(sum level43 level23 level66)
(sum level44 level1 level45)
(sum level44 level3 level47)
(sum level44 level8 level52)
(sum level44 level10 level54)
(sum level44 level14 level58)
(sum level44 level20 level64)
(sum level44 level23 level67)
(sum level45 level1 level46)
(sum level45 level3 level48)
(sum level45 level8 level53)
(sum level45 level10 level55)
(sum level45 level14 level59)
(sum level45 level20 level65)
(sum level45 level23 level68)
(sum level46 level1 level47)
(sum level46 level3 level49)
(sum level46 level8 level54)
(sum level46 level10 level56)
(sum level46 level14 level60)
(sum level46 level20 level66)
(sum level46 level23 level69)
(sum level47 level1 level48)
(sum level47 level3 level50)
(sum level47 level8 level55)
(sum level47 level10 level57)
(sum level47 level14 level61)
(sum level47 level20 level67)
(sum level47 level23 level70)
(sum level48 level1 level49)
(sum level48 level3 level51)
(sum level48 level8 level56)
(sum level48 level10 level58)
(sum level48 level14 level62)
(sum level48 level20 level68)
(sum level49 level1 level50)
(sum level49 level3 level52)
(sum level49 level8 level57)
(sum level49 level10 level59)
(sum level49 level14 level63)
(sum level49 level20 level69)
(sum level50 level1 level51)
(sum level50 level3 level53)
(sum level50 level8 level58)
(sum level50 level10 level60)
(sum level50 level14 level64)
(sum level50 level20 level70)
(sum level51 level1 level52)
(sum level51 level3 level54)
(sum level51 level8 level59)
(sum level51 level10 level61)
(sum level51 level14 level65)
(sum level52 level1 level53)
(sum level52 level3 level55)
(sum level52 level8 level60)
(sum level52 level10 level62)
(sum level52 level14 level66)
(sum level53 level1 level54)
(sum level53 level3 level56)
(sum level53 level8 level61)
(sum level53 level10 level63)
(sum level53 level14 level67)
(sum level54 level1 level55)
(sum level54 level3 level57)
(sum level54 level8 level62)
(sum level54 level10 level64)
(sum level54 level14 level68)
(sum level55 level1 level56)
(sum level55 level3 level58)
(sum level55 level8 level63)
(sum level55 level10 level65)
(sum level55 level14 level69)
(sum level56 level1 level57)
(sum level56 level3 level59)
(sum level56 level8 level64)
(sum level56 level10 level66)
(sum level56 level14 level70)
(sum level57 level1 level58)
(sum level57 level3 level60)
(sum level57 level8 level65)
(sum level57 level10 level67)
(sum level58 level1 level59)
(sum level58 level3 level61)
(sum level58 level8 level66)
(sum level58 level10 level68)
(sum level59 level1 level60)
(sum level59 level3 level62)
(sum level59 level8 level67)
(sum level59 level10 level69)
(sum level60 level1 level61)
(sum level60 level3 level63)
(sum level60 level8 level68)
(sum level60 level10 level70)
(sum level61 level1 level62)
(sum level61 level3 level64)
(sum level61 level8 level69)
(sum level62 level1 level63)
(sum level62 level3 level65)
(sum level62 level8 level70)
(sum level63 level1 level64)
(sum level63 level3 level66)
(sum level64 level1 level65)
(sum level64 level3 level67)
(sum level65 level1 level66)
(sum level65 level3 level68)
(sum level66 level1 level67)
(sum level66 level3 level69)
(sum level67 level1 level68)
(sum level67 level3 level70)
(sum level68 level1 level69)
(sum level69 level1 level70)

(connected l0 l3)
(fuelcost level3 l0 l3)
(connected l0 l4)
(fuelcost level8 l0 l4)
(connected l1 l2)
(fuelcost level10 l1 l2)
(connected l1 l3)
(fuelcost level23 l1 l3)
(connected l1 l4)
(fuelcost level14 l1 l4)
(connected l2 l1)
(fuelcost level10 l2 l1)
(connected l2 l4)
(fuelcost level1 l2 l4)
(connected l3 l0)
(fuelcost level3 l3 l0)
(connected l3 l1)
(fuelcost level23 l3 l1)
(connected l3 l4)
(fuelcost level20 l3 l4)
(connected l4 l0)
(fuelcost level8 l4 l0)
(connected l4 l1)
(fuelcost level14 l4 l1)
(connected l4 l2)
(fuelcost level1 l4 l2)
(connected l4 l3)
(fuelcost level20 l4 l3)

(at t0 l0)
(fuel t0 level70)
(= (total-cost) 0)

(at p0 l2)
(at p1 l4)
(at p2 l1)
(at p3 l1)
(at p4 l4)
(at p5 l3)
(at p6 l0)
(at p7 l2)
(at p8 l0)
(at p9 l4)
(at p10 l1)
(at p11 l4)
(at p12 l4)
(at p13 l4)
(at p14 l1)
(at p15 l4)
)

(:goal
(and
(at p0 l1)
(at p1 l0)
(at p2 l4)
(at p3 l2)
(at p4 l3)
(at p5 l2)
(at p6 l3)
(at p7 l4)
(at p8 l1)
(at p9 l3)
(at p10 l0)
(at p11 l2)
(at p12 l0)
(at p13 l1)
(at p14 l3)
(at p15 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p8 t0 l0)
   deleted: (at p8 l0)
   added: (in p8 t0)
   goals met: 0 of 16
2. (load p6 t0 l0)
   deleted: (at p6 l0)
   added: (in p6 t0)
   goals met: 0 of 16
3. (drive t0 l0 l4 level62 level8 level70)
   deleted: (at t0 l0) (fuel t0 level70)
   added: (at t0 l4) (fuel t0 level62)
   goals met: 0 of 16
4. (load p9 t0 l4)
   deleted: (at p9 l4)
   added: (in p9 t0)
   goals met: 0 of 16
5. (load p4 t0 l4)
   deleted: (at p4 l4)
   added: (in p4 t0)
   goals met: 0 of 16
6. (load p15 t0 l4)
   deleted: (at p15 l4)
   added: (in p15 t0)
   goals met: 0 of 16
7. (load p13 t0 l4)
   deleted: (at p13 l4)
   added: (in p13 t0)
   goals met: 0 of 16
8. (load p12 t0 l4)
   deleted: (at p12 l4)
   added: (in p12 t0)
   goals met: 0 of 16
9. (load p11 t0 l4)
   deleted: (at p11 l4)
   added: (in p11 t0)
   goals met: 0 of 16
10. (load p1 t0 l4)
   deleted: (at p1 l4)
   added: (in p1 t0)
   goals met: 0 of 16
11. (drive t0 l4 l2 level61 level1 level62)
   deleted: (at t0 l4) (fuel t0 level62)
   added: (at t0 l2) (fuel t0 level61)
   goals met: 0 of 16
12. (unload p15 t0 l2)
   deleted: (in p15 t0)
   added: (at p15 l2)
   goals met: 1 of 16
13. (unload p11 t0 l2)
   deleted: (in p11 t0)
   added: (at p11 l2)
   goals met: 2 of 16
14. (load p7 t0 l2)
   deleted: (at p7 l2)
   added: (in p7 t0)
   goals met: 2 of 16
15. (load p0 t0 l2)
   deleted: (at p0 l2)
   added: (in p0 t0)
   goals met: 2 of 16
16. (drive t0 l2 l1 level51 level10 level61)
   deleted: (at t0 l2) (fuel t0 level61)
   added: (at t0 l1) (fuel t0 level51)
   goals met: 2 of 16
17. (unload p8 t0 l1)
   deleted: (in p8 t0)
   added: (at p8 l1)
   goals met: 3 of 16
18. (unload p13 t0 l1)
   deleted: (in p13 t0)
   added: (at p13 l1)
   goals met: 4 of 16
19. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 5 of 16
20. (load p3 t0 l1)
   deleted: (at p3 l1)
   added: (in p3 t0)
   goals met: 5 of 16
21. (load p2 t0 l1)
   deleted: (at p2 l1)
   added: (in p2 t0)
   goals met: 5 of 16
22. (load p14 t0 l1)
   deleted: (at p14 l1)
   added: (in p14 t0)
   goals met: 5 of 16
23. (load p10 t0 l1)
   deleted: (at p10 l1)
   added: (in p10 t0)
   goals met: 5 of 16
24. (drive t0 l1 l3 level28 level23 level51)
   deleted: (at t0 l1) (fuel t0 level51)
   added: (at t0 l3) (fuel t0 level28)
   goals met: 5 of 16
25. (load p5 t0 l3)
   deleted: (at p5 l3)
   added: (in p5 t0)
   goals met: 5 of 16
26. (unload p14 t0 l3)
   deleted: (in p14 t0)
   added: (at p14 l3)
   goals met: 6 of 16
27. (unload p4 t0 l3)
   deleted: (in p4 t0)
   added: (at p4 l3)
   goals met: 7 of 16
28. (unload p6 t0 l3)
   deleted: (in p6 t0)
   added: (at p6 l3)
   goals met: 8 of 16
29. (unload p9 t0 l3)
   deleted: (in p9 t0)
   added: (at p9 l3)
   goals met: 9 of 16
30. (drive t0 l3 l0 level25 level3 level28)
   deleted: (at t0 l3) (fuel t0 level28)
   added: (at t0 l0) (fuel t0 level25)
   goals met: 9 of 16
31. (unload p1 t0 l0)
   deleted: (in p1 t0)
   added: (at p1 l0)
   goals met: 10 of 16
32. (unload p10 t0 l0)
   deleted: (in p10 t0)
   added: (at p10 l0)
   goals met: 11 of 16
33. (unload p12 t0 l0)
   deleted: (in p12 t0)
   added: (at p12 l0)
   goals met: 12 of 16
34. (drive t0 l0 l4 level17 level8 level25)
   deleted: (at t0 l0) (fuel t0 level25)
   added: (at t0 l4) (fuel t0 level17)
   goals met: 12 of 16
35. (unload p2 t0 l4)
   deleted: (in p2 t0)
   added: (at p2 l4)
   goals met: 13 of 16
36. (unload p7 t0 l4)
   deleted: (in p7 t0)
   added: (at p7 l4)
   goals met: 14 of 16
37. (drive t0 l4 l2 level16 level1 level17)
   deleted: (at t0 l4) (fuel t0 level17)
   added: (at t0 l2) (fuel t0 level16)
   goals met: 14 of 16
38. (unload p3 t0 l2)
   deleted: (in p3 t0)
   added: (at p3 l2)
   goals met: 15 of 16
39. (unload p5 t0 l2)
   deleted: (in p5 t0)
   added: (at p5 l2)
   goals met: 16 of 16
